; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 67363 2 2 3 8 4
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	spectrograph2 - mode
	thermograph1 - mode
	infrared0 - mode
	Star1 - direction
	Star3 - direction
	Star5 - direction
	GroundStation7 - direction
	Star0 - direction
	Star6 - direction
	GroundStation4 - direction
	GroundStation2 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
	Star11 - direction
)
(:init
	(supports instrument0 spectrograph2)
	(supports instrument0 infrared0)
	(calibration_target instrument0 Star6)
	(calibration_target instrument0 Star0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star3)
	(supports instrument1 thermograph1)
	(supports instrument1 infrared0)
	(calibration_target instrument1 GroundStation2)
	(calibration_target instrument1 GroundStation4)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon9)
)
(:goal (and
	(pointing satellite0 Star3)
	(pointing satellite1 Phenomenon10)
	(have_image Planet8 infrared0)
	(have_image Phenomenon9 infrared0)
	(have_image Phenomenon10 infrared0)
	(have_image Star11 thermograph1)
))

)

; plan
1. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 1 of 6
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 6
3. (turn_to satellite1 star11 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 star11)
   goals met: 1 of 6
4. (turn_to satellite0 star0 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 star0)
   goals met: 0 of 6
5. (calibrate satellite0 instrument0 star0)
   added: (calibrated instrument0)
   goals met: 0 of 6
6. (turn_to satellite1 groundstation2 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 groundstation2)
   goals met: 0 of 6
7. (turn_to satellite0 planet8 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 planet8)
   goals met: 0 of 6
8. (calibrate satellite1 instrument1 groundstation2)
   added: (calibrated instrument1)
   goals met: 0 of 6
9. (take_image satellite0 planet8 instrument0 infrared0)
   added: (have_image planet8 infrared0)
   goals met: 1 of 6
10. (turn_to satellite1 star11 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 star11)
   goals met: 1 of 6
11. (turn_to satellite0 star3 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star3)
   goals met: 2 of 6
12. (take_image satellite1 star11 instrument1 thermograph1)
   added: (have_image star11 thermograph1)
   goals met: 3 of 6
13. (turn_to satellite1 phenomenon10 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 phenomenon10)
   goals met: 4 of 6
14. (turn_to satellite0 phenomenon9 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 phenomenon9)
   goals met: 3 of 6
15. (take_image satellite1 phenomenon10 instrument1 infrared0)
   added: (have_image phenomenon10 infrared0)
   goals met: 4 of 6
16. (take_image satellite0 phenomenon9 instrument0 infrared0)
   added: (have_image phenomenon9 infrared0)
   goals met: 5 of 6
17. (turn_to satellite0 star3 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 star3)
   goals met: 6 of 6
